ExperimentResults/multiple-producer-1-to-single-consumer.txt
41949 records sent, 8376.4 records/sec (7.99 MB/sec), 541.1 ms avg latency, 1248.0 ms max latency.
56627 records sent, 11302.8 records/sec (10.78 MB/sec), 263.3 ms avg latency, 1258.0 ms max latency.
50820 records sent, 10164.0 records/sec (9.69 MB/sec), 123.5 ms avg latency, 395.0 ms max latency.
22246 records sent, 4443.0 records/sec (4.24 MB/sec), 1259.0 ms avg latency, 3620.0 ms max latency.
20426 records sent, 4082.8 records/sec (3.89 MB/sec), 3789.3 ms avg latency, 7040.0 ms max latency.
22680 records sent, 4530.6 records/sec (4.32 MB/sec), 5779.7 ms avg latency, 10214.0 ms max latency.
28350 records sent, 5651.9 records/sec (5.39 MB/sec), 8739.3 ms avg latency, 13409.0 ms max latency.
23814 records sent, 4561.2 records/sec (4.35 MB/sec), 10711.3 ms avg latency, 16910.0 ms max latency.
37044 records sent, 7401.4 records/sec (7.06 MB/sec), 11467.2 ms avg latency, 19029.0 ms max latency.
29484 records sent, 5850.0 records/sec (5.58 MB/sec), 11530.3 ms avg latency, 20382.0 ms max latency.
33390 records sent, 6510.0 records/sec (6.21 MB/sec), 10249.4 ms avg latency, 18035.0 ms max latency.
38808 records sent, 6223.2 records/sec (5.93 MB/sec), 10084.7 ms avg latency, 17368.0 ms max latency.
28224 records sent, 5624.6 records/sec (5.36 MB/sec), 10205.2 ms avg latency, 18507.0 ms max latency.
30744 records sent, 6147.6 records/sec (5.86 MB/sec), 11313.4 ms avg latency, 20234.0 ms max latency.
25326 records sent, 5058.1 records/sec (4.82 MB/sec), 12183.7 ms avg latency, 21381.0 ms max latency.
29232 records sent, 4804.7 records/sec (4.58 MB/sec), 12025.2 ms avg latency, 21698.0 ms max latency.
30240 records sent, 6028.7 records/sec (5.75 MB/sec), 13453.7 ms avg latency, 25362.0 ms max latency.
35217 records sent, 7043.4 records/sec (6.72 MB/sec), 11199.9 ms avg latency, 20613.0 ms max latency.
39779 records sent, 7949.4 records/sec (7.58 MB/sec), 10161.7 ms avg latency, 19203.0 ms max latency.
24885 records sent, 4925.8 records/sec (4.70 MB/sec), 9236.1 ms avg latency, 18527.0 ms max latency.
19593 records sent, 3906.9 records/sec (3.73 MB/sec), 12104.4 ms avg latency, 19187.0 ms max latency.
23586 records sent, 4695.6 records/sec (4.48 MB/sec), 12618.2 ms avg latency, 20208.0 ms max latency.
31311 records sent, 6253.4 records/sec (5.96 MB/sec), 13487.2 ms avg latency, 20865.0 ms max latency.
36099 records sent, 7193.9 records/sec (6.86 MB/sec), 12488.8 ms avg latency, 21656.0 ms max latency.
43911 records sent, 8750.7 records/sec (8.35 MB/sec), 8833.5 ms avg latency, 17848.0 ms max latency.
31159 records sent, 6230.6 records/sec (5.94 MB/sec), 8251.9 ms avg latency, 15328.0 ms max latency.
32274 records sent, 6211.3 records/sec (5.92 MB/sec), 11114.5 ms avg latency, 15314.0 ms max latency.
38485 records sent, 7672.4 records/sec (7.32 MB/sec), 11175.6 ms avg latency, 15015.0 ms max latency.
44724 records sent, 8941.2 records/sec (8.53 MB/sec), 8512.8 ms avg latency, 12313.0 ms max latency.
51854 records sent, 10362.5 records/sec (9.88 MB/sec), 5875.4 ms avg latency, 9700.0 ms max latency.
52543 records sent, 10496.0 records/sec (10.01 MB/sec), 6108.5 ms avg latency, 10283.0 ms max latency.
29464 records sent, 5886.9 records/sec (5.61 MB/sec), 6971.4 ms avg latency, 11242.0 ms max latency.
20916 records sent, 4173.2 records/sec (3.98 MB/sec), 9843.2 ms avg latency, 16344.0 ms max latency.
34272 records sent, 6813.5 records/sec (6.50 MB/sec), 10008.0 ms avg latency, 17547.0 ms max latency.
28214 records sent, 5252.0 records/sec (5.01 MB/sec), 11120.5 ms avg latency, 19836.0 ms max latency.
9954 records sent, 1940.7 records/sec (1.85 MB/sec), 12918.2 ms avg latency, 23489.0 ms max latency.
40819 records sent, 7804.8 records/sec (7.44 MB/sec), 14950.5 ms avg latency, 23882.0 ms max latency.
49014 records sent, 9765.7 records/sec (9.31 MB/sec), 11064.9 ms avg latency, 18914.0 ms max latency.
54558 records sent, 10822.9 records/sec (10.32 MB/sec), 6868.1 ms avg latency, 15327.0 ms max latency.
47628 records sent, 9519.9 records/sec (9.08 MB/sec), 6477.2 ms avg latency, 10688.0 ms max latency.
46242 records sent, 9248.4 records/sec (8.82 MB/sec), 6897.3 ms avg latency, 11322.0 ms max latency.
52038 records sent, 10384.8 records/sec (9.90 MB/sec), 6904.7 ms avg latency, 11230.0 ms max latency.
31500 records sent, 6289.9 records/sec (6.00 MB/sec), 7538.1 ms avg latency, 12686.0 ms max latency.
67914 records sent, 13574.7 records/sec (12.95 MB/sec), 6728.0 ms avg latency, 12455.0 ms max latency.
11340 records sent, 1966.0 records/sec (1.87 MB/sec), 6786.4 ms avg latency, 15443.0 ms max latency.
6552 records sent, 977.3 records/sec (0.93 MB/sec), 13207.8 ms avg latency, 21477.0 ms max latency.
15498 records sent, 3097.7 records/sec (2.95 MB/sec), 17934.3 ms avg latency, 22673.0 ms max latency.
27846 records sent, 5569.2 records/sec (5.31 MB/sec), 16131.9 ms avg latency, 25625.0 ms max latency.
23184 records sent, 4540.5 records/sec (4.33 MB/sec), 18561.1 ms avg latency, 29196.0 ms max latency.
32634 records sent, 6512.5 records/sec (6.21 MB/sec), 16804.0 ms avg latency, 31167.0 ms max latency.
45486 records sent, 9068.2 records/sec (8.65 MB/sec), 11198.6 ms avg latency, 30135.0 ms max latency.
36288 records sent, 7210.0 records/sec (6.88 MB/sec), 8299.3 ms avg latency, 15866.0 ms max latency.
36666 records sent, 7298.2 records/sec (6.96 MB/sec), 8508.5 ms avg latency, 13950.0 ms max latency.
36666 records sent, 7312.7 records/sec (6.97 MB/sec), 8994.9 ms avg latency, 15410.0 ms max latency.
32004 records sent, 6380.4 records/sec (6.08 MB/sec), 9098.1 ms avg latency, 16995.0 ms max latency.
34398 records sent, 6876.8 records/sec (6.56 MB/sec), 9655.9 ms avg latency, 17295.0 ms max latency.
35154 records sent, 7015.4 records/sec (6.69 MB/sec), 9925.1 ms avg latency, 17050.0 ms max latency.
32508 records sent, 6473.1 records/sec (6.17 MB/sec), 9723.0 ms avg latency, 17003.0 ms max latency.
6804 records sent, 1173.3 records/sec (1.12 MB/sec), 10673.9 ms avg latency, 19677.0 ms max latency.
7686 records sent, 1535.7 records/sec (1.46 MB/sec), 11562.0 ms avg latency, 25147.0 ms max latency.
30114 records sent, 6004.8 records/sec (5.73 MB/sec), 16821.2 ms avg latency, 27158.0 ms max latency.
38502 records sent, 7672.8 records/sec (7.32 MB/sec), 14655.2 ms avg latency, 27193.0 ms max latency.
33894 records sent, 6777.4 records/sec (6.46 MB/sec), 13218.0 ms avg latency, 28039.0 ms max latency.
44478 records sent, 8851.3 records/sec (8.44 MB/sec), 9172.0 ms avg latency, 27336.0 ms max latency.
40572 records sent, 8103.1 records/sec (7.73 MB/sec), 8319.6 ms avg latency, 16584.0 ms max latency.
37800 records sent, 7503.0 records/sec (7.16 MB/sec), 8202.3 ms avg latency, 16077.0 ms max latency.
14868 records sent, 2915.9 records/sec (2.78 MB/sec), 10538.9 ms avg latency, 17787.0 ms max latency.
5166 records sent, 1030.9 records/sec (0.98 MB/sec), 14576.4 ms avg latency, 22468.0 ms max latency.
10710 records sent, 1864.2 records/sec (1.78 MB/sec), 16507.5 ms avg latency, 27100.0 ms max latency.
3654 records sent, 699.6 records/sec (0.67 MB/sec), 22411.3 ms avg latency, 31962.0 ms max latency.
47502 records sent, 8432.8 records/sec (8.04 MB/sec), 18446.2 ms avg latency, 32495.0 ms max latency.
22302 records sent, 4292.1 records/sec (4.09 MB/sec), 18791.5 ms avg latency, 34138.0 ms max latency.
4662 records sent, 881.3 records/sec (0.84 MB/sec), 17768.2 ms avg latency, 38818.0 ms max latency.
13104 records sent, 2619.8 records/sec (2.50 MB/sec), 26070.6 ms avg latency, 41602.0 ms max latency.
19908 records sent, 3972.9 records/sec (3.79 MB/sec), 19395.5 ms avg latency, 39726.0 ms max latency.
6930 records sent, 1153.1 records/sec (1.10 MB/sec), 22444.5 ms avg latency, 35439.0 ms max latency.
13608 records sent, 2671.9 records/sec (2.55 MB/sec), 23573.4 ms avg latency, 35785.0 ms max latency.
10710 records sent, 2136.0 records/sec (2.04 MB/sec), 26616.5 ms avg latency, 40539.0 ms max latency.
10710 records sent, 1949.4 records/sec (1.86 MB/sec), 26040.7 ms avg latency, 43860.0 ms max latency.
1134 records sent, 221.3 records/sec (0.21 MB/sec), 21068.8 ms avg latency, 45321.0 ms max latency.
4032 records sent, 802.2 records/sec (0.77 MB/sec), 30929.3 ms avg latency, 53735.0 ms max latency.
3150 records sent, 613.2 records/sec (0.58 MB/sec), 38577.9 ms avg latency, 58381.0 ms max latency.
1512 records sent, 297.7 records/sec (0.28 MB/sec), 43577.5 ms avg latency, 63291.0 ms max latency.
4158 records sent, 808.5 records/sec (0.77 MB/sec), 46865.6 ms avg latency, 66814.0 ms max latency.
3402 records sent, 673.9 records/sec (0.64 MB/sec), 47594.5 ms avg latency, 71254.0 ms max latency.
3906 records sent, 543.4 records/sec (0.52 MB/sec), 52493.8 ms avg latency, 73565.0 ms max latency.
8694 records sent, 1717.5 records/sec (1.64 MB/sec), 54634.8 ms avg latency, 80699.0 ms max latency.
12600 records sent, 2515.5 records/sec (2.40 MB/sec), 49515.0 ms avg latency, 83803.0 ms max latency.
14364 records sent, 2871.7 records/sec (2.74 MB/sec), 46339.3 ms avg latency, 79464.0 ms max latency.
13482 records sent, 2672.3 records/sec (2.55 MB/sec), 46152.1 ms avg latency, 82502.0 ms max latency.
18018 records sent, 3599.3 records/sec (3.43 MB/sec), 41751.9 ms avg latency, 82613.0 ms max latency.
18396 records sent, 3656.5 records/sec (3.49 MB/sec), 33634.3 ms avg latency, 78632.0 ms max latency.
12852 records sent, 2356.4 records/sec (2.25 MB/sec), 29035.6 ms avg latency, 74887.0 ms max latency.
17136 records sent, 3273.4 records/sec (3.12 MB/sec), 25059.7 ms avg latency, 76770.0 ms max latency.
15373 records sent, 3067.2 records/sec (2.93 MB/sec), 20146.4 ms avg latency, 53517.0 ms max latency.
13886 records sent, 2771.1 records/sec (2.64 MB/sec), 25890.7 ms avg latency, 41937.0 ms max latency.
10219 records sent, 2039.3 records/sec (1.94 MB/sec), 25785.4 ms avg latency, 40783.0 ms max latency.
21597 records sent, 4066.5 records/sec (3.88 MB/sec), 25477.0 ms avg latency, 40385.0 ms max latency.
16714 records sent, 3316.3 records/sec (3.16 MB/sec), 24340.3 ms avg latency, 37873.0 ms max latency.
14133 records sent, 2822.6 records/sec (2.69 MB/sec), 20599.9 ms avg latency, 36724.0 ms max latency.
15020 records sent, 2865.9 records/sec (2.73 MB/sec), 22555.6 ms avg latency, 34926.0 ms max latency.
18521 records sent, 3660.3 records/sec (3.49 MB/sec), 20640.7 ms avg latency, 34831.0 ms max latency.
9121 records sent, 1817.3 records/sec (1.73 MB/sec), 22840.0 ms avg latency, 34471.0 ms max latency.
14007 records sent, 2770.9 records/sec (2.64 MB/sec), 24478.7 ms avg latency, 33599.0 ms max latency.
9598 records sent, 587.0 records/sec (0.56 MB/sec), 23836.1 ms avg latency, 35145.0 ms max latency.
29003 records sent, 5777.5 records/sec (5.51 MB/sec), 26683.9 ms avg latency, 46675.0 ms max latency.
9576 records sent, 1858.7 records/sec (1.77 MB/sec), 25206.9 ms avg latency, 46988.0 ms max latency.
10951 records sent, 2164.2 records/sec (2.06 MB/sec), 29691.6 ms avg latency, 49603.0 ms max latency.
38391 records sent, 7322.3 records/sec (6.98 MB/sec), 27663.7 ms avg latency, 49193.0 ms max latency.
46664 records sent, 9332.8 records/sec (8.90 MB/sec), 15552.6 ms avg latency, 41599.0 ms max latency.
43339 records sent, 8636.7 records/sec (8.24 MB/sec), 7200.5 ms avg latency, 21048.0 ms max latency.
51656 records sent, 10302.4 records/sec (9.83 MB/sec), 6848.6 ms avg latency, 13375.0 ms max latency.
23486 records sent, 4646.1 records/sec (4.43 MB/sec), 8938.1 ms avg latency, 14646.0 ms max latency.
18205 records sent, 3507.7 records/sec (3.35 MB/sec), 12502.9 ms avg latency, 17123.0 ms max latency.
24709 records sent, 4937.8 records/sec (4.71 MB/sec), 14293.4 ms avg latency, 18613.0 ms max latency.
38124 records sent, 7617.2 records/sec (7.26 MB/sec), 12555.1 ms avg latency, 19171.0 ms max latency.
24573 records sent, 4620.7 records/sec (4.41 MB/sec), 10148.0 ms avg latency, 18872.0 ms max latency.
58130 records sent, 11626.0 records/sec (11.09 MB/sec), 9402.0 ms avg latency, 18552.0 ms max latency.
35778 records sent, 7152.7 records/sec (6.82 MB/sec), 8125.0 ms avg latency, 12618.0 ms max latency.
37676 records sent, 7532.2 records/sec (7.18 MB/sec), 7636.3 ms avg latency, 11121.0 ms max latency.
12516 records sent, 2452.7 records/sec (2.34 MB/sec), 11327.2 ms avg latency, 14662.0 ms max latency.
2647 records sent, 527.7 records/sec (0.50 MB/sec), 13688.0 ms avg latency, 19430.0 ms max latency.
5828 records sent, 1165.4 records/sec (1.11 MB/sec), 17822.8 ms avg latency, 24018.0 ms max latency.
23397 records sent, 4471.9 records/sec (4.26 MB/sec), 21564.0 ms avg latency, 25634.0 ms max latency.
32048 records sent, 6318.6 records/sec (6.03 MB/sec), 20249.8 ms avg latency, 26869.0 ms max latency.
36792 records sent, 6581.8 records/sec (6.28 MB/sec), 14631.9 ms avg latency, 27274.0 ms max latency.
40443 records sent, 8013.3 records/sec (7.64 MB/sec), 9610.2 ms avg latency, 15073.0 ms max latency.
39170 records sent, 7791.9 records/sec (7.43 MB/sec), 9646.5 ms avg latency, 13182.0 ms max latency.
35784 records sent, 7126.9 records/sec (6.80 MB/sec), 7619.1 ms avg latency, 12829.0 ms max latency.
13734 records sent, 2654.4 records/sec (2.53 MB/sec), 9658.7 ms avg latency, 16091.0 ms max latency.
13608 records sent, 2708.1 records/sec (2.58 MB/sec), 12234.4 ms avg latency, 19374.0 ms max latency.
16380 records sent, 2217.1 records/sec (2.11 MB/sec), 14115.9 ms avg latency, 22388.0 ms max latency.
49687 records sent, 9919.5 records/sec (9.46 MB/sec), 16794.6 ms avg latency, 26659.0 ms max latency.
40653 records sent, 7886.1 records/sec (7.52 MB/sec), 12916.2 ms avg latency, 24509.0 ms max latency.
42246 records sent, 8440.8 records/sec (8.05 MB/sec), 7468.5 ms avg latency, 14871.0 ms max latency.
32508 records sent, 6336.8 records/sec (6.04 MB/sec), 7937.6 ms avg latency, 13539.0 ms max latency.
30670 records sent, 6087.7 records/sec (5.81 MB/sec), 9867.8 ms avg latency, 15255.0 ms max latency.
19575 records sent, 3884.7 records/sec (3.70 MB/sec), 13288.7 ms avg latency, 17077.0 ms max latency.
27680 records sent, 5519.4 records/sec (5.26 MB/sec), 12931.2 ms avg latency, 17772.0 ms max latency.
30681 records sent, 6130.1 records/sec (5.85 MB/sec), 12094.9 ms avg latency, 17545.0 ms max latency.
27594 records sent, 5454.4 records/sec (5.20 MB/sec), 11327.3 ms avg latency, 17922.0 ms max latency.
13104 records sent, 2159.2 records/sec (2.06 MB/sec), 10834.1 ms avg latency, 19373.0 ms max latency.
39690 records sent, 7672.5 records/sec (7.32 MB/sec), 12903.7 ms avg latency, 21482.0 ms max latency.
45990 records sent, 9185.1 records/sec (8.76 MB/sec), 8456.2 ms avg latency, 26541.0 ms max latency.
31208 records sent, 6232.9 records/sec (5.94 MB/sec), 10054.4 ms avg latency, 25625.0 ms max latency.
2646 records sent, 393.2 records/sec (0.37 MB/sec), 11446.1 ms avg latency, 31619.0 ms max latency.
28476 records sent, 5316.7 records/sec (5.07 MB/sec), 15435.9 ms avg latency, 32669.0 ms max latency.
28476 records sent, 5694.1 records/sec (5.43 MB/sec), 13584.7 ms avg latency, 33569.0 ms max latency.
23886 records sent, 4743.1 records/sec (4.52 MB/sec), 13501.2 ms avg latency, 32575.0 ms max latency.
33712 records sent, 6710.2 records/sec (6.40 MB/sec), 15546.7 ms avg latency, 33821.0 ms max latency.
44866 records sent, 8946.4 records/sec (8.53 MB/sec), 10813.3 ms avg latency, 31924.0 ms max latency.
36478 records sent, 7273.8 records/sec (6.94 MB/sec), 9342.5 ms avg latency, 23502.0 ms max latency.
11151 records sent, 2216.9 records/sec (2.11 MB/sec), 9319.0 ms avg latency, 25724.0 ms max latency.
24402 records sent, 4859.0 records/sec (4.63 MB/sec), 12078.5 ms avg latency, 28365.0 ms max latency.
26991 records sent, 5395.0 records/sec (5.15 MB/sec), 14071.6 ms avg latency, 26059.0 ms max latency.
24560 records sent, 4891.5 records/sec (4.66 MB/sec), 11804.7 ms avg latency, 28100.0 ms max latency.
21924 records sent, 4368.2 records/sec (4.17 MB/sec), 13798.5 ms avg latency, 30705.0 ms max latency.
35028 records sent, 6988.8 records/sec (6.67 MB/sec), 12729.3 ms avg latency, 31457.0 ms max latency.
34367 records sent, 6854.2 records/sec (6.54 MB/sec), 11016.6 ms avg latency, 31064.0 ms max latency.
36178 records sent, 7215.4 records/sec (6.88 MB/sec), 10635.1 ms avg latency, 27290.0 ms max latency.
41076 records sent, 8187.4 records/sec (7.81 MB/sec), 9444.9 ms avg latency, 25954.0 ms max latency.
30114 records sent, 6013.2 records/sec (5.73 MB/sec), 8961.2 ms avg latency, 21850.0 ms max latency.
27234 records sent, 5426.2 records/sec (5.17 MB/sec), 10205.4 ms avg latency, 23697.0 ms max latency.
21343 records sent, 4234.7 records/sec (4.04 MB/sec), 12148.1 ms avg latency, 24920.0 ms max latency.
28816 records sent, 5755.1 records/sec (5.49 MB/sec), 11137.7 ms avg latency, 25382.0 ms max latency.
14112 records sent, 2374.2 records/sec (2.26 MB/sec), 11260.9 ms avg latency, 25673.0 ms max latency.
252 records sent, 38.4 records/sec (0.04 MB/sec), 16661.9 ms avg latency, 30340.0 ms max latency.
86688 records sent, 17337.6 records/sec (16.53 MB/sec), 13462.9 ms avg latency, 36030.0 ms max latency.
47754 records sent, 9539.4 records/sec (9.10 MB/sec), 9773.6 ms avg latency, 28686.0 ms max latency.
33012 records sent, 6602.4 records/sec (6.30 MB/sec), 7712.1 ms avg latency, 24387.0 ms max latency.
10458 records sent, 2010.0 records/sec (1.92 MB/sec), 8459.9 ms avg latency, 18839.0 ms max latency.
7056 records sent, 1225.4 records/sec (1.17 MB/sec), 10672.3 ms avg latency, 22969.0 ms max latency.
23333 records sent, 4638.8 records/sec (4.42 MB/sec), 13791.0 ms avg latency, 28204.0 ms max latency.
19178 records sent, 2996.1 records/sec (2.86 MB/sec), 16985.7 ms avg latency, 31909.0 ms max latency.
24169 records sent, 4828.0 records/sec (4.60 MB/sec), 15780.8 ms avg latency, 34823.0 ms max latency.
31649 records sent, 6197.2 records/sec (5.91 MB/sec), 17023.3 ms avg latency, 37213.0 ms max latency.
33727 records sent, 6744.1 records/sec (6.43 MB/sec), 15456.3 ms avg latency, 37213.0 ms max latency.
29736 records sent, 5929.4 records/sec (5.65 MB/sec), 10984.8 ms avg latency, 34034.0 ms max latency.
24696 records sent, 4931.3 records/sec (4.70 MB/sec), 12222.5 ms avg latency, 27835.0 ms max latency.
27720 records sent, 5544.0 records/sec (5.29 MB/sec), 11018.0 ms avg latency, 25851.0 ms max latency.
28350 records sent, 5645.2 records/sec (5.38 MB/sec), 11129.9 ms avg latency, 26810.0 ms max latency.
11844 records sent, 2349.5 records/sec (2.24 MB/sec), 12282.7 ms avg latency, 30346.0 ms max latency.
2394 records sent, 438.4 records/sec (0.42 MB/sec), 15817.4 ms avg latency, 34476.0 ms max latency.
1386 records sent, 249.8 records/sec (0.24 MB/sec), 21451.9 ms avg latency, 39811.0 ms max latency.
504 records sent, 69.9 records/sec (0.07 MB/sec), 24219.9 ms avg latency, 47122.0 ms max latency.
126 records sent, 22.8 records/sec (0.02 MB/sec), 47686.9 ms avg latency, 52644.0 ms max latency.
33957 records sent, 6780.6 records/sec (6.47 MB/sec), 21663.0 ms avg latency, 57045.0 ms max latency.
40399 records sent, 8078.2 records/sec (7.70 MB/sec), 44732.7 ms avg latency, 55899.0 ms max latency.
5000000 records sent, 5022.031653 records/sec (4.79 MB/sec), 12731.04 ms avg latency, 83803.00 ms max latency, 10873 ms 50th, 33884 ms 95th, 57930 ms 99th, 81137 ms 99.9th.